In [1]:
import pandas as pd

In [2]:
drinks = pd.read_csv('../data-repo/drinks.csv')

drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [6]:
pd.get_option('display.max_rows')

60

In [7]:
pd.set_option('display.max_rows', 10)
# 重置为默认
#pd.reset_option('display.max_rows')

In [8]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [9]:
train = pd.read_csv('../data-repo/titanic_train.csv')

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# 可以设置每一列的显示长度
pd.get_option('display.max_colwidth')

50

In [14]:
# 可以设置显示位数精度，默认为6，修改后并不会影响源数据的实际精度，只是展示不同
pd.get_option('display.precision')

6

In [15]:
drinks['x'] = drinks.beer_servings * 1000

In [17]:
drinks['x']

0           0
1       89000
2       25000
3      245000
4      217000
        ...
188    333000
189    111000
190      6000
191     32000
192     64000
Name: x, Length: 193, dtype: int64

In [18]:
# 将float类型转换为',' 表示
pd.set_option('display.float_format', '{:,}'.format)

In [28]:
# 查询
pd.describe_option('display.float_format')

display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]

In [29]:
# reset 全部已修改的options，可忽略警告
pd.reset_option('all')

height has been deprecated.

line_width has been deprecated, use display.width instead (currently both are
identical)

/home/shannonliang/workspace/python/python3/lib/python3.5/site-packages/ipykernel_launcher.py:1: FutureWarning:
mpl_style had been deprecated and will be removed in a future version.
Use `matplotlib.pyplot.style.use` instead.

  """Entry point for launching an IPython kernel.